combined/BEEGFS-all-master-node/fio-barenode-read-buffered-block_1024k-size_1G-threads_4.log
fio-beegfs-read-buffered-block_1024k-size_1G-threads_4: (g=0): rw=rw, bs=1M-1M/1M-1M/1M-1M, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 4 processes
fio-beegfs-read-buffered-block_1024k-size_1G-threads_4: Laying out IO file(s) (4 file(s) / 4096MB)
fio-beegfs-read-buffered-block_1024k-size_1G-threads_4: Laying out IO file(s) (4 file(s) / 4096MB)
fio-beegfs-read-buffered-block_1024k-size_1G-threads_4: Laying out IO file(s) (4 file(s) / 4096MB)
[...]

fio-beegfs-read-buffered-block_1024k-size_1G-threads_4: (groupid=0, jobs=4): err= 0: pid=3476043: Fri Nov  9 07:49:45 2018
  read : io=677001MB, bw=2820.8MB/s, iops=2820, runt=240009msec
    clat (usec): min=899, max=25808, avg=1415.90, stdev=160.23
     lat (usec): min=899, max=25808, avg=1416.04, stdev=160.23
    clat percentiles (usec):
     |  1.00th=[ 1160],  5.00th=[ 1240], 10.00th=[ 1272], 20.00th=[ 1320],
     | 30.00th=[ 1352], 40.00th=[ 1368], 50.00th=[ 1400], 60.00th=[ 1416],
     | 70.00th=[ 1448], 80.00th=[ 1480], 90.00th=[ 1544], 95.00th=[ 1688],
     | 99.00th=[ 2024], 99.50th=[ 2192], 99.90th=[ 2544], 99.95th=[ 2736],
     | 99.99th=[ 3248]
    bw (KB  /s): min=647920, max=761856, per=25.02%, avg=722753.82, stdev=16124.86
    lat (usec) : 1000=0.01%
    lat (msec) : 2=98.88%, 4=1.10%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=0.23%, sys=71.72%, ctx=3861991, majf=0, minf=16815
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=677001/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=677001MB, aggrb=2820.8MB/s, minb=2820.8MB/s, maxb=2820.8MB/s, mint=240009msec, maxt=240009msec

CPU idleness:
  system: 90.63%
  unit work: mean=53.08us, stddev=3.38