combined/BEEGFS-all-master-node/fio-barenode-read-buffered-block_1024k-size_4G-threads_2.log
fio-beegfs-read-buffered-block_1024k-size_4G-threads_2: (g=0): rw=rw, bs=1M-1M/1M-1M/1M-1M, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 2 processes
fio-beegfs-read-buffered-block_1024k-size_4G-threads_2: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-read-buffered-block_1024k-size_4G-threads_2: Laying out IO file(s) (4 file(s) / 16384MB)

fio-beegfs-read-buffered-block_1024k-size_4G-threads_2: (groupid=0, jobs=2): err= 0: pid=3448579: Fri Nov  9 05:37:18 2018
  read : io=455661MB, bw=1898.6MB/s, iops=1898, runt=240001msec
    clat (usec): min=777, max=9978, avg=1051.44, stdev=75.86
     lat (usec): min=777, max=9978, avg=1051.58, stdev=75.86
    clat percentiles (usec):
     |  1.00th=[  916],  5.00th=[  940], 10.00th=[  964], 20.00th=[  988],
     | 30.00th=[ 1004], 40.00th=[ 1032], 50.00th=[ 1048], 60.00th=[ 1064],
     | 70.00th=[ 1096], 80.00th=[ 1112], 90.00th=[ 1144], 95.00th=[ 1160],
     | 99.00th=[ 1256], 99.50th=[ 1320], 99.90th=[ 1448], 99.95th=[ 1496],
     | 99.99th=[ 1608]
    bw (KB  /s): min=919760, max=1015808, per=50.05%, avg=972993.07, stdev=16730.21
    lat (usec) : 1000=26.41%
    lat (msec) : 2=73.59%, 4=0.01%, 10=0.01%
  cpu          : usr=0.33%, sys=69.79%, ctx=1969888, majf=0, minf=9781
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=455661/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=455661MB, aggrb=1898.6MB/s, minb=1898.6MB/s, maxb=1898.6MB/s, mint=240001msec, maxt=240001msec

CPU idleness:
  system: 85.98%
  unit work: mean=49.16us, stddev=2.67