combined/BEEGFS-all-master-node/fio-barenode-read-buffered-block_128k-size_4G-threads_2.log
fio-beegfs-read-buffered-block_128k-size_4G-threads_2: (g=0): rw=rw, bs=128K-128K/128K-128K/128K-128K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 2 processes
fio-beegfs-read-buffered-block_128k-size_4G-threads_2: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-read-buffered-block_128k-size_4G-threads_2: Laying out IO file(s) (4 file(s) / 16384MB)

fio-beegfs-read-buffered-block_128k-size_4G-threads_2: (groupid=0, jobs=2): err= 0: pid=3432517: Fri Nov  9 04:17:53 2018
  read : io=388178MB, bw=1617.5MB/s, iops=12939, runt=240001msec
    clat (usec): min=9, max=12079, avg=153.50, stdev=248.55
     lat (usec): min=9, max=12079, avg=153.59, stdev=248.57
    clat percentiles (usec):
     |  1.00th=[    9],  5.00th=[    9], 10.00th=[    9], 20.00th=[   10],
     | 30.00th=[   10], 40.00th=[   10], 50.00th=[   10], 60.00th=[   12],
     | 70.00th=[   21], 80.00th=[  524], 90.00th=[  580], 95.00th=[  620],
     | 99.00th=[  732], 99.50th=[  788], 99.90th=[  972], 99.95th=[ 1032],
     | 99.99th=[ 1112]
    bw (KB  /s): min=790528, max=863744, per=50.03%, avg=828589.96, stdev=10029.64
    lat (usec) : 10=12.96%, 20=52.37%, 50=9.53%, 100=0.13%, 250=0.01%
    lat (usec) : 500=1.64%, 750=22.58%, 1000=0.71%
    lat (msec) : 2=0.07%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=1.00%, sys=71.38%, ctx=1552769, majf=0, minf=46976
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=3105423/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=388178MB, aggrb=1617.5MB/s, minb=1617.5MB/s, maxb=1617.5MB/s, mint=240001msec, maxt=240001msec

CPU idleness:
  system: 92.63%
  unit work: mean=53.00us, stddev=3.86