combined/BEEGFS-all-master-node/fio-barenode-read-buffered-block_16k-size_2G-threads_2.log
fio-beegfs-read-buffered-block_16k-size_2G-threads_2: (g=0): rw=rw, bs=16K-16K/16K-16K/16K-16K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 2 processes
fio-beegfs-read-buffered-block_16k-size_2G-threads_2: Laying out IO file(s) (4 file(s) / 8192MB)
fio-beegfs-read-buffered-block_16k-size_2G-threads_2: Laying out IO file(s) (4 file(s) / 8192MB)

fio-beegfs-read-buffered-block_16k-size_2G-threads_2: (groupid=0, jobs=2): err= 0: pid=3386042: Fri Nov  9 00:46:20 2018
  read : io=362974MB, bw=1512.4MB/s, iops=96792, runt=240001msec
    clat (usec): min=1, max=10503, avg=19.97, stdev=100.45
     lat (usec): min=1, max=10503, avg=20.04, stdev=100.46
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    2], 90.00th=[    3], 95.00th=[    4],
     | 99.00th=[  588], 99.50th=[  620], 99.90th=[  732], 99.95th=[  788],
     | 99.99th=[  940]
    bw (KB  /s): min=731104, max=811008, per=50.03%, avg=774762.44, stdev=14390.52
    lat (usec) : 2=16.08%, 4=78.36%, 10=2.15%, 20=0.18%, 50=0.09%
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.23%, 750=2.82%, 1000=0.07%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=4.43%, sys=69.27%, ctx=1380068, majf=0, minf=282816
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=23230365/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=362974MB, aggrb=1512.4MB/s, minb=1512.4MB/s, maxb=1512.4MB/s, mint=240001msec, maxt=240001msec

CPU idleness:
  system: 91.17%
  unit work: mean=52.19us, stddev=2.60