combined/BEEGFS-all-master-node/fio-barenode-read-unbuffered-block_1024k-size_4G-threads_8.log
fio-beegfs-read-unbuffered-block_1024k-size_4G-threads_8: (g=0): rw=rw, bs=1M-1M/1M-1M/1M-1M, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 8 processes
fio-beegfs-read-unbuffered-block_1024k-size_4G-threads_8: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-read-unbuffered-block_1024k-size_4G-threads_8: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-read-unbuffered-block_1024k-size_4G-threads_8: Laying out IO file(s) (4 file(s) / 16384MB)
[...]

fio-beegfs-read-unbuffered-block_1024k-size_4G-threads_8: (groupid=0, jobs=8): err= 0: pid=3946613: Thu Nov 22 20:26:56 2018
  read : io=122971MB, bw=524650KB/s, iops=512, runt=240012msec
    clat (msec): min=8, max=44, avg=15.61, stdev= 1.11
     lat (msec): min=8, max=44, avg=15.61, stdev= 1.11
    clat percentiles (usec):
     |  1.00th=[15168],  5.00th=[15168], 10.00th=[15168], 20.00th=[15296],
     | 30.00th=[15296], 40.00th=[15296], 50.00th=[15296], 60.00th=[15424],
     | 70.00th=[15552], 80.00th=[15552], 90.00th=[15808], 95.00th=[17024],
     | 99.00th=[21632], 99.50th=[23680], 99.90th=[25984], 99.95th=[26752],
     | 99.99th=[30336]
    bw (KB  /s): min=58687, max=68133, per=12.51%, avg=65647.37, stdev=1550.70
    lat (msec) : 10=0.02%, 20=98.45%, 50=1.53%
  cpu          : usr=0.02%, sys=4.47%, ctx=514864, majf=0, minf=2295
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=122971/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=122971MB, aggrb=524650KB/s, minb=524650KB/s, maxb=524650KB/s, mint=240012msec, maxt=240012msec

CPU idleness:
  system: 94.71%
  unit work: mean=53.36us, stddev=2.54